Repository: tildearrow/furnace
Catalog: po/staging/*-diggo.po
Languages: pt_br

source: 20xx: Set channel mode (bit 0: square; bit 1: noise; bit 2: envelope)
pt_br: 20xx: Definir modo de canal (bit 0: quadrado; bit 1: ruído; bit 2: envelope)

source: 21xx: Set noise frequency (0 to 1F)
pt_br: 21xx: Definir frequência de ruído (0 a 1F)

source: 22xy: Set envelope mode (x: shape, y: enable for this channel)
pt_br: 22xy: Definir modo de envelope (x: forma, y: habilitar para este canal)

source: 23xx: Set envelope period low byte
pt_br: 23xx: Definir byte baixo do período de envelope

source: 24xx: Set envelope period high byte
pt_br: 24xx: Definir byte alto do período de envelope

source: 25xx: Envelope slide up
pt_br: 25xx: Deslizar envelope para cima

source: 26xx: Envelope slide down
pt_br: 26xx: Deslizar envelope para baixo

source: 29xy: Set auto-envelope (x: numerator; y: denominator)
pt_br: 29xy: Definir auto-envelope (x: numerador; y: denominador)

source: 2Exx: Write to I/O port A
pt_br: 2Exx: Escrever no porto de E/S A

source: 2Fxx: Write to I/O port B
pt_br: 2Fxx: Escrever no porto de E/S B

source: 21xx: Set noise frequency (0 to FF)
pt_br: 21xx: Definir frequência de ruído (0 a FF)

source: 12xx: Set duty cycle (0 to 8)
pt_br: 12xx: Definir ciclo de trabalho (0 a 8)

source: 27xx: Set noise AND mask
pt_br: 27xx: Definir máscara AND de ruído

source: 28xx: Set noise OR mask
pt_br: 28xx: Definir máscara OR de ruído

source: 2Cxy: Automatic noise frequency (x: mode (0: disable, 1: freq, 2: freq + OR mask); y: offset
pt_br: 2Cxy: Frequência de ruído automática (x: modo (0: desativar, 1: freq, 2: freq + máscara OR); y: compensação

source: 2Dxx: NOT TO BE EMPLOYED BY THE COMPOSER
pt_br: 2Dxx: NÃO DEVE SER UTILIZADO PELO COMPOSITOR

source: 30xx: Toggle hard envelope reset on new notes
pt_br: 30xx: Alternar reinício rígido de envelope em novas notas

source: 18xx: Toggle extended channel 3 mode
pt_br: 18xx: Alternar modo de canal estendido 3

source: 17xx: Toggle PCM mode (LEGACY)
pt_br: 17xx: Alternar modo PCM (LEGADO)

source: DFxx: Set sample playback direction (0: normal; 1: reverse)
pt_br: DFxx: Definir direção de reprodução da amostra (0: normal; 1: reverso)

source: 18xx: Toggle drums mode (1: enabled; 0: disabled)
pt_br: 18xx: Alternar modo de bateria (1: habilitado; 0: desabilitado)

source: 11xx: Set feedback (0 to 7)
pt_br: 11xx: Definir feedback (0 a 7)

source: 12xx: Set level of operator 1 (0 highest, 7F lowest)
pt_br: 12xx: Definir nível do operador 1 (0 mais alto, 7F mais baixo)

source: 13xx: Set level of operator 2 (0 highest, 7F lowest)
pt_br: 13xx: Definir nível do operador 2 (0 mais alto, 7F mais baixo)

source: 14xx: Set level of operator 3 (0 highest, 7F lowest)
pt_br: 14xx: Definir nível do operador 3 (0 mais alto, 7F mais baixo)

source: 15xx: Set level of operator 4 (0 highest, 7F lowest)
pt_br: 15xx: Definir nível do operador 4 (0 mais alto, 7F mais baixo)

source: 16xy: Set operator multiplier (x: operator from 1 to 4; y: multiplier)
pt_br: 16xy: Definir multiplicador do operador (x: operador de 1 a 4; y: multiplicador)

source: 19xx: Set attack of all operators (0 to 1F)
pt_br: 19xx: Definir ataque de todos os operadores (0 a 1F)

source: 1Axx: Set attack of operator 1 (0 to 1F)
pt_br: 1Axx: Definir ataque do operador 1 (0 a 1F)

source: 1Bxx: Set attack of operator 2 (0 to 1F)
pt_br: 1Bxx: Definir ataque do operador 2 (0 a 1F)

source: 1Cxx: Set attack of operator 3 (0 to 1F)
pt_br: 1Cxx: Definir ataque do operador 3 (0 a 1F)

source: 1Dxx: Set attack of operator 4 (0 to 1F)
pt_br: 1Dxx: Definir ataque do operador 4 (0 a 1F)

source: 50xy: Set AM (x: operator from 1 to 4 (0 for all ops); y: AM)
pt_br: 50xy: Definir AM (x: operador de 1 a 4 (0 para todos os ops); y: AM)

source: 51xy: Set sustain level (x: operator from 1 to 4 (0 for all ops); y: sustain)
pt_br: 51xy: Definir nível de sustain (x: operador de 1 a 4 (0 para todos os ops); y: sustain)

source: 52xy: Set release (x: operator from 1 to 4 (0 for all ops); y: release)
pt_br: 52xy: Definir release (x: operador de 1 a 4 (0 para todos os ops); y: release)

source: 53xy: Set detune (x: operator from 1 to 4 (0 for all ops); y: detune where 3 is center)
pt_br: 53xy: Definir detune (x: operador de 1 a 4 (0 para todos os ops); y: detune onde 3 é o centro)

source: 54xy: Set envelope scale (x: operator from 1 to 4 (0 for all ops); y: scale from 0 to 3)
pt_br: 54xy: Definir escala de envelope (x: operador de 1 a 4 (0 para todos os ops); y: escala de 0 a 3)

source: 56xx: Set decay of all operators (0 to 1F)
pt_br: 56xx: Definir decay de todos os operadores (0 a 1F)

source: 57xx: Set decay of operator 1 (0 to 1F)
pt_br: 57xx: Definir decay do operador 1 (0 a 1F)

source: 58xx: Set decay of operator 2 (0 to 1F)
pt_br: 58xx: Definir decay do operador 2 (0 a 1F)

source: 59xx: Set decay of operator 3 (0 to 1F)
pt_br: 59xx: Definir decay do operador 3 (0 a 1F)

source: 5Axx: Set decay of operator 4 (0 to 1F)
pt_br: 5Axx: Definir decay do operador 4 (0 a 1F)

source: 5Bxx: Set decay 2 of all operators (0 to 1F)
pt_br: 5Bxx: Definir decay 2 de todos os operadores (0 a 1F)

source: 5Cxx: Set decay 2 of operator 1 (0 to 1F)
pt_br: 5Cxx: Definir decay 2 do operador 1 (0 a 1F)

source: 5Dxx: Set decay 2 of operator 2 (0 to 1F)
pt_br: 5Dxx: Definir decay 2 do operador 2 (0 a 1F)

source: 5Exx: Set decay 2 of operator 3 (0 to 1F)
pt_br: 5Exx: Definir decay 2 do operador 3 (0 a 1F)

source: 5Fxx: Set decay 2 of operator 4 (0 to 1F)
pt_br: 5Fxx: Definir decay 2 do operador 4 (0 a 1F)

source: 10xx: Set noise frequency (xx: value; 0 disables noise)
pt_br: 10xx: Definir frequência de ruído (xx: valor; 0 desabilita o ruído)

source: 17xx: Set LFO speed
pt_br: 17xx: Definir velocidade do LFO

source: 18xx: Set LFO waveform (0 saw, 1 square, 2 triangle, 3 noise)
pt_br: 18xx: Definir forma de onda do LFO (0 serra, 1 quadrada, 2 triangular, 3 ruído)

source: 1Exx: Set AM depth (0 to 7F)
pt_br: 1Exx: Definir profundidade de AM (0 a 7F)

source: 1Fxx: Set PM depth (0 to 7F)
pt_br: 1Fxx: Definir profundidade de PM (0 a 7F)

source: 55xy: Set detune 2 (x: operator from 1 to 4 (0 for all ops); y: detune from 0 to 3)
pt_br: 55xy: Definir detune 2 (x: operador de 1 a 4 (0 para todos os ops); y: detune de 0 a 3)

source: 24xx: Set LFO 2 speed
pt_br: 24xx: Definir velocidade do LFO 2

source: 25xx: Set LFO 2 waveform (0 saw, 1 square, 2 triangle, 3 noise)
pt_br: 25xx: Definir forma de onda do LFO 2 (0 serra, 1 quadrada, 2 triangular, 3 ruído)

source: 26xx: Set AM 2 depth (0 to 7F)
pt_br: 26xx: Definir profundidade de AM 2 (0 a 7F)

source: 27xx: Set PM 2 depth (0 to 7F)
pt_br: 27xx: Definir profundidade de PM 2 (0 a 7F)

source: 28xy: Set reverb (x: operator from 1 to 4 (0 for all ops); y: reverb from 0 to 7)
pt_br: 28xy: Definir reverb (x: operador de 1 a 4 (0 para todos os ops); y: reverb de 0 a 7)

source: 2Axy: Set waveform (x: operator from 1 to 4 (0 for all ops); y: waveform from 0 to 7)
pt_br: 2Axy: Definir forma de onda (x: operador de 1 a 4 (0 para todos os ops); y: forma de onda de 0 a 7)

source: 2Bxy: Set envelope generator shift (x: operator from 1 to 4 (0 for all ops); y: shift from 0 to 3)
pt_br: 2Bxy: Definir deslocamento do gerador de envelope (x: operador de 1 a 4 (0 para todos os ops); y: deslocamento de 0 a 3)

source: 2Cxy: Set fine multiplier (x: operator from 1 to 4 (0 for all ops); y: fine)
pt_br: 2Cxy: Definir multiplicador fino (x: operador de 1 a 4 (0 para todos os ops); y: fino)

source: 3xyy: Set fixed frequency of operator 1 (x: octave from 0 to 7; y: frequency)
pt_br: 3xyy: Definir frequência fixa do operador 1 (x: oitava de 0 a 7; y: frequência)

source: 3xyy: Set fixed frequency of operator 2 (x: octave from 8 to F; y: frequency)
pt_br: 3xyy: Definir frequência fixa do operador 2 (x: oitava de 8 a F; y: frequência)

source: 4xyy: Set fixed frequency of operator 3 (x: octave from 0 to 7; y: frequency)
pt_br: 4xyy: Definir frequência fixa do operador 3 (x: oitava de 0 a 7; y: frequência)

source: 4xyy: Set fixed frequency of operator 4 (x: octave from 8 to F; y: frequency)
pt_br: 4xyy: Definir frequência fixa do operador 4 (x: oitava de 8 a F; y: frequência)

source: 10xy: Setup LFO (x: enable; y: speed)
pt_br: 10xy: Configurar LFO (x: habilitar; y: velocidade)

source: 55xy: Set SSG envelope (x: operator from 1 to 4 (0 for all ops); y: 0-7 on, 8 off)
pt_br: 55xy: Definir envelope SSG (x: operador de 1 a 4 (0 para todos os ops); y: 0-7 ligado, 8 desligado)

source: 1Fxx: Set ADPCM-A global volume (0 to 3F)
pt_br: 1Fxx: Definir volume global ADPCM-A (0 a 3F)

source: 10xx: Set patch (0 to F)
pt_br: 10xx: Definir patch (0 a F)

source: 12xx: Set level of operator 1 (0 highest, 3F lowest)
pt_br: 12xx: Definir nível do operador 1 (0 mais alto, 3F mais baixo)

source: 13xx: Set level of operator 2 (0 highest, 3F lowest)
pt_br: 13xx: Definir nível do operador 2 (0 mais alto, 3F mais baixo)

source: 16xy: Set operator multiplier (x: operator from 1 to 2; y: multiplier)
pt_br: 16xy: Definir multiplicador do operador (x: operador de 1 a 2; y: multiplicador)

source: 19xx: Set attack of all operators (0 to F)
pt_br: 19xx: Definir ataque de todos os operadores (0 a F)

source: 1Axx: Set attack of operator 1 (0 to F)
pt_br: 1Axx: Definir ataque do operador 1 (0 a F)

source: 1Bxx: Set attack of operator 2 (0 to F)
pt_br: 1Bxx: Definir ataque do operador 2 (0 a F)

source: 50xy: Set AM (x: operator from 1 to 2 (0 for all ops); y: AM)
pt_br: 50xy: Definir AM (x: operador de 1 a 2 (0 para todos os ops); y: AM)

source: 51xy: Set sustain level (x: operator from 1 to 2 (0 for all ops); y: sustain)
pt_br: 51xy: Definir nível de sustain (x: operador de 1 a 2 (0 para todos os ops); y: sustain)

source: 52xy: Set release (x: operator from 1 to 2 (0 for all ops); y: release)
pt_br: 52xy: Definir release (x: operador de 1 a 2 (0 para todos os ops); y: release)

source: 53xy: Set vibrato (x: operator from 1 to 2 (0 for all ops); y: enabled)
pt_br: 53xy: Definir vibrato (x: operador de 1 a 2 (0 para todos os ops); y: ativado)

source: 54xy: Set envelope scale (x: operator from 1 to 2 (0 for all ops); y: scale from 0 to 3)
pt_br: 54xy: Definir escala de envelope (x: operador de 1 a 2 (0 para todos os ops); y: escala de 0 a 3)

source: 55xy: Set envelope sustain (x: operator from 1 to 2 (0 for all ops); y: enabled)
pt_br: 55xy: Definir sustain de envelope (x: operador de 1 a 2 (0 para todos os ops); y: ativado)

source: 56xx: Set decay of all operators (0 to F)
pt_br: 56xx: Definir decay de todos os operadores (0 a F)

source: 57xx: Set decay of operator 1 (0 to F)
pt_br: 57xx: Definir decay do operador 1 (0 a F)

source: 58xx: Set decay of operator 2 (0 to F)
pt_br: 58xx: Definir decay do operador 2 (0 a F)

source: 5Bxy: Set whether key will scale envelope (x: operator from 1 to 2 (0 for all ops); y: enabled)
pt_br: 5Bxy: Definir se a tecla irá escalar o envelope (x: operador de 1 a 2 (0 para todos os ops); y: ativado)

source: 10xx: Set global AM depth (0: 1dB, 1: 4.8dB)
pt_br: 10xx: Definir profundidade global de AM (0: 1dB, 1: 4.8dB)

source: 14xx: Set level of operator 3 (0 highest, 3F lowest)
pt_br: 14xx: Definir nível do operador 3 (0 mais alto, 3F mais baixo)

source: 15xx: Set level of operator 4 (0 highest, 3F lowest)
pt_br: 15xx: Definir nível do operador 4 (0 mais alto, 3F mais baixo)

source: 17xx: Set global vibrato depth (0: normal, 1: double)
pt_br: 17xx: Definir profundidade global de vibrato (0: normal, 1: dobrado)

source: 1Cxx: Set attack of operator 3 (0 to F)
pt_br: 1Cxx: Definir ataque do operador 3 (0 a F)

source: 1Dxx: Set attack of operator 4 (0 to F)
pt_br: 1Dxx: Definir ataque do operador 4 (0 a F)

source: 2Axy: Set waveform (x: operator from 1 to 4 (0 for all ops); y: waveform from 0 to 3 in OPL2 and 0 to 7 in OPL3)
pt_br: 2Axy: Definir forma de onda (x: operador de 1 a 4 (0 para todos os ops); y: forma de onda de 0 a 3 no OPL2 e de 0 a 7 no OPL3)

source: 53xy: Set vibrato (x: operator from 1 to 4 (0 for all ops); y: enabled)
pt_br: 53xy: Definir vibrato (x: operador de 1 a 4 (0 para todos os ops); y: ativado)

source: 55xy: Set envelope sustain (x: operator from 1 to 4 (0 for all ops); y: enabled)
pt_br: 55xy: Definir sustain de envelope (x: operador de 1 a 4 (0 para todos os ops); y: ativado)

source: 59xx: Set decay of operator 3 (0 to F)
pt_br: 59xx: Definir decay do operador 3 (0 a F)

source: 5Axx: Set decay of operator 4 (0 to F)
pt_br: 5Axx: Definir decay do operador 4 (0 a F)

source: 5Bxy: Set whether key will scale envelope (x: operator from 1 to 4 (0 for all ops); y: enabled)
pt_br: 5Bxy: Definir se a tecla irá escalar o envelope (x: operador de 1 a 4 (0 para todos os ops); y: ativado)

source: 10xx: Set waveform (bit 0: triangle; bit 1: saw; bit 2: pulse; bit 3: noise)
pt_br: 10xx: Definir forma de onda (bit 0: triângulo; bit 1: dente de serra; bit 2: pulso; bit 3: ruído)

source: 11xx: Set coarse cutoff (not recommended; use 4xxx instead)
pt_br: 11xx: Definir corte de agudos (não recomendado; use 4xxx em vez disso)

source: 12xx: Set coarse pulse width (not recommended; use 3xxx instead)
pt_br: 12xx: Definir largura de pulso (não recomendado; use 3xxx em vez disso)

source: 13xx: Set resonance (0 to F)
pt_br: 13xx: Definir ressonância (0 a F)

source: 14xx: Set filter mode (bit 0: low pass; bit 1: band pass; bit 2: high pass)
pt_br: 14xx: Definir modo de filtro (bit 0: low pass; bit 1: band pass; bit 2: high pass)

source: 15xx: Set envelope reset time
pt_br: 15xx: Definir tempo de reset do envelope

source: 1Axx: Disable envelope reset for this channel (1 disables; 0 enables)
pt_br: 1Axx: Desativar reset do envelope para este canal (1 desabilita; 0 habilita)

source: 1Bxy: Reset cutoff (x: on new note; y: now)
pt_br: 1Bxy: Resetar corte (x: na nova nota; y: agora)

source: 1Cxy: Reset pulse width (x: on new note; y: now)
pt_br: 1Cxy: Resetar largura de pulso (x: na nova nota; y: agora)

source: 1Exy: Change other parameters (LEGACY)
pt_br: 1Exy: Mudar outros parâmetros (LEGACY)

source: 20xy: Set attack/decay (x: attack; y: decay)
pt_br: 20xy: Definir ataque/decaimento (x: ataque; y: decaimento)

source: 21xy: Set sustain/release (x: sustain; y: release)
pt_br: 21xy: Definir sustentação/liberação (x: sustentação; y: liberação)

source: 3xxx: Set pulse width (0 to FFF)
pt_br: 3xxx: Definir largura de pulso (0 a FFF)

source: 4xxx: Set cutoff (0 to 7FF)
pt_br: 4xxx: Definir corte (0 a 7FF)

source: 10xx: Set waveform
pt_br: 10xx: Definir onda

source: 20xx: Set PCM frequency
pt_br: 20xx: Definir frequência do PCM

source: 10xy: Set AM depth (x: operator from 1 to 4 (0 for all ops); y: depth (0: 1dB, 1: 4.8dB))
pt_br: 10xy: Definir AM depth (x: operator do 1 para o 4 (0 para todos ops); y: depth (0: 1dB, 1: 4.8dB))

source: 17xy: Set vibrato depth (x: operator from 1 to 4 (0 for all ops); y: depth (0: normal, 1: double))
pt_br: 17xy: Definir vibrato depth (x: operator do 1 para o 4 (0 para todos ops); y: depth (0: normal, 1: dobrado))

source: 20xy: Set panning of operator 1 (x: left; y: right)
pt_br: 20xy: Definir panorama do operador 1 (x: esquerda; y: direita)

source: 21xy: Set panning of operator 2 (x: left; y: right)
pt_br: 21xy: Definir panorama do operador 2 (x: esquerda; y: direita)

source: 22xy: Set panning of operator 3 (x: left; y: right)
pt_br: 22xy: Definir panorama do operador 3 (x: esquerda; y: direita)

source: 23xy: Set panning of operator 4 (x: left; y: right)
pt_br: 23xy: Definir panorama do operador 4 (x: esquerda; y: direita)

source: 24xy: Set output level register (x: operator from 1 to 4 (0 for all ops); y: level from 0 to 7)
pt_br: 24xy: Definir registro de nível de saída (x: operador de 1 a 4 (0 para todas as operações); y: nível de 0 a 7)

source: 25xy: Set modulation input level (x: operator from 1 to 4 (0 for all ops); y: level from 0 to 7)
pt_br: 25xy: Definir nível de entrada de modulação (x: operador de 1 a 4 (0 para todas as operações); y: nível de 0 a 7)

source: 26xy: Set envelope delay (x: operator from 1 to 4 (0 for all ops); y: delay from 0 to 7)
pt_br: 26xy: Definir atraso de envelope (x: operador de 1 a 4 (0 para todas as operações); y: atraso de 0 a 7)

source: 27xx: Set noise mode for operator 4 (x: mode from 0 to 3)
pt_br: 27xx: Definir modo de ruído para o operador 4 (x: modo de 0 a 3)

source: 2Fxy: Set fixed frequency block (x: operator from 1 to 4; y: octave from 0 to 7)
pt_br: 2Fxy: Definir bloco de frequência fixa (x: operador de 1 a 4; y: oitava de 0 a 7)

source: 40xx: Set detune of operator 1 (80: center)
pt_br: 40xx: Definir desafinação do operador 1 (80: centro)

source: 41xx: Set detune of operator 2 (80: center)
pt_br: 41xx: Definir desafinação do operador 2 (80: centro)

source: 42xx: Set detune of operator 3 (80: center)
pt_br: 42xx: Definir desafinação do operador 3 (80: centro)

source: 43xx: Set detune of operator 4 (80: center)
pt_br: 43xx: Definir desafinação do operador 4 (80: centro)

source: 3xyy: Set fixed frequency F-num of operator 1 (x: high 2 bits from 0 to 3; y: low 8 bits of F-num)
pt_br: 3xyy: Definir F-num fixo de frequência do operador 1 (x: bits altos 2 de 0 a 3; y: bits baixos 8 do F-num)

source: 3xyy: Set fixed frequency F-num of operator 2 (x: high 2 bits from 4 to 7; y: low 8 bits of F-num)
pt_br: 3xyy: Definir F-num fixo de frequência do operador 2 (x: bits altos 2 de 4 a 7; y: bits baixos 8 do F-num)

source: 3xyy: Set fixed frequency F-num of operator 3 (x: high 2 bits from 8 to B; y: low 8 bits of F-num)
pt_br: 3xyy: Definir F-num fixo de frequência do operador 3 (x: bits altos 2 de 8 a B; y: bits baixos 8 do F-num)

source: 3xyy: Set fixed frequency F-num of operator 4 (x: high 2 bits from C to F; y: low 8 bits of F-num)
pt_br: 3xyy: Definir F-num fixo de frequência do operador 4 (x: bits altos 2 de C a F; y: bits baixos 8 do F-num)

source: 11xx: Set resonance (0 to FF)
pt_br: 11xx: Definir ressonância (0 a FF)

source: 12xx: Set filter mode (bit 0: low pass; bit 1: band pass; bit 2: high pass)
pt_br: 12xx: Definir modo de filtro (bit 0: passa-baixa; bit 1: passa-banda; bit 2: passa-alta)

source: 13xx: Disable envelope reset for this channel (1 disables; 0 enables)
pt_br: 13xx: Desativar reset de envelope para este canal (1 desativa; 0 habilita)

source: 14xy: Reset cutoff (x: on new note; y: now)
pt_br: 14xy: Resetar corte (x: na nova nota; y: agora)

source: 15xy: Reset pulse width (x: on new note; y: now)
pt_br: 15xy: Resetar largura de pulso (x: na nova nota; y: agora)

source: 16xy: Change other parameters
pt_br: 16xy: Mudar outros parâmetros

source: 4xxx: Set cutoff (0 to FFF)
pt_br: 4xxx: Definir corte (0 a FFF)

source: a chip which found its way inside mobile phones in the 2000's. as proprietary as it is, it passed away after losing to MP3 in the mobile hardware battle.
pt_br: um chip que encontrou seu caminho dentro de telefones celulares nos anos 2000. tão proprietário quanto é, ele faleceu após perder para o MP3 na batalha de hardware móvel.

source: Channel 1
pt_br: Canal 1

source: Channel 2
pt_br: Canal 2

source: Channel 3
pt_br: Canal 3

source: Channel 4
pt_br: Canal 4

source: Channel 5
pt_br: Canal 5

source: Channel 6
pt_br: Canal 6

source: Channel 7
pt_br: Canal 7

source: Channel 8
pt_br: Canal 8

source: Channel 9
pt_br: Canal 9

source: Channel 10
pt_br: Canal 10

source: Channel 11
pt_br: Canal 11

source: Channel 13
pt_br: Canal 13

source: Channel 14
pt_br: Canal 14

source: Channel 15
pt_br: Canal 15

source: Channel 16
pt_br: Canal 16

source: Sega Genesis Extended Channel 3
pt_br: Sega Genesis Canal 3 Extendido

source: Square 1
pt_br: Quadrada 1

source: Square 2
pt_br: Quadrada 2

source: Square 3
pt_br: Quadrada 3

source: Noise
pt_br: Ruído

source: the most popular portable game console of the era.
pt_br: o console de jogos portátil mais popular da época

source: 11xx: Set noise length (0: long; 1: short)
pt_br: 11xx: Definir comprimento do ruído (0: longo; 1: curto)

source: 12xx: Set duty cycle (0 to 3)
pt_br: 12xx: Definir ciclo de trabalho (0 a 3)

source: 13xy: Setup sweep (x: time; y: shift)
pt_br: 13xy: Configurar varredura (x: tempo; y: deslocamento)

source: 14xx: Set sweep direction (0: up; 1: down)
pt_br: 14xx: Definir direção de varredura (0: para cima; 1: para baixo)

source: an '80s game console with a wavetable sound chip, popular in Japan.
pt_br: um console de jogos dos anos 80 com chip de som wavetable, popular no Japão.
